tap "humansignal/tap"
brew "boost"
brew "chezmoi"
brew "cmake"
brew "colima"
brew "docker"
brew "fastfetch"
brew "fd"
brew "sdl2"
brew "ffmpeg"
brew "fmt"
brew "gh"
brew "git"
brew "htop"
brew "hugo"
brew "openjdk@21"
brew "kotlin-language-server"
brew "ktlint"
brew "lazygit"
brew "llvm"
brew "neovim"
brew "ninja"
brew "node"
brew "nodebrew"
brew "openjdk@17"
brew "payload-dumper-go"
brew "peco"
brew "postgresql@14"
brew "pyenv"
brew "pyright"
brew "python@3.13"
brew "tcl-tk"
brew "python-tk@3.13"
brew "qemu"
brew "ripgrep"
brew "sdl3"
brew "sheldon"
brew "starship"
brew "tailscale"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "vim"
brew "wget"
brew "winetricks"
brew "wireshark"
brew "yt-dlp"
brew "humansignal/tap/label-studio"
cask "android-studio"
cask "appcleaner"
cask "bambu-studio"
cask "batfi"
cask "bitwarden"
cask "blackhole-2ch"
cask "cemu"
cask "cursor"
cask "desmume"
cask "discord"
cask "dolphin"
cask "eqmac"
cask "firefox"
cask "floorp"
cask "font-hack-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "grandperspective"
cask "gstreamer-runtime"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keka"
cask "lm-studio"
cask "lmms"
cask "localsend"
cask "logisim-evolution"
cask "maccy"
cask "middleclick"
cask "mochi-diffusion"
cask "mos"
cask "motrix"
cask "notion"
cask "obs"
cask "obsidian"
cask "omnidisksweeper"
cask "openmtp"
cask "orbstack"
cask "poi"
cask "raycast"
cask "rectangle"
cask "retroarch"
cask "scroll-reverser"
cask "slack"
cask "steam"
cask "thunderbird"
cask "utm"
cask "vesktop"
cask "virtualbox"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "visualboyadvance-m"
cask "vlc"
cask "wezterm"
cask "wine-stable"
cask "xquartz"
cask "zed"
cask "zoom"
