tap "humansignal/tap"

# CLI tools
brew "boost"
brew "chezmoi"
brew "cmake"
brew "colima"
brew "docker"
brew "fastfetch"
brew "ffmpeg"
brew "fmt"
brew "gh"
brew "git"
brew "htop"
brew "hugo"
brew "ninja"
brew "nodebrew"
brew "openjdk@17"
brew "openjdk@21"
brew "payload-dumper-go"
brew "peco"
brew "postgresql@14"
brew "python@3.13"
brew "python-tk@3.13"
brew "qemu"
brew "sdl2"
brew "sdl3"
brew "starship"
brew "tailscale"
brew "tcl-tk"
brew "tree"
brew "vim"
brew "wget"
brew "winetricks"
brew "wireshark"
brew "yt-dlp"
brew "humansignal/tap/label-studio"

# Cask applications
cask "android-studio"
cask "appcleaner"
cask "bambu-studio"
cask "batfi"
cask "bitwarden"
cask "cemu"
cask "cursor"
cask "desmume"
cask "discord"
cask "dolphin"
cask "eqmac"
cask "firefox"
cask "floorp"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "grandperspective"
cask "gstreamer-runtime"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "lm-studio"
cask "lmms"
cask "localsend"
cask "logisim-evolution"
cask "maccy"
cask "middleclick"
cask "mochi-diffusion"
cask "mos"
cask "motrix"
cask "notion"
cask "obs"
cask "obsidian"
cask "openmtp"
cask "orbstack"
cask "poi"
cask "raycast"
cask "rectangle"
cask "retroarch"
cask "scroll-reverser"
cask "slack"
cask "steam"
cask "thunderbird"
cask "vesktop"
cask "virtualbox"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "visualboyadvance-m"
cask "vlc"
cask "wezterm"
cask "wine-stable"
cask "xquartz"
cask "zed"
cask "zoom"

# VS Code extensions
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bradgashler.htmltagwrap"
vscode "cstef.kotlin-formatter"
vscode "cwan.native-ascii-converter"
vscode "cweijan.vscode-office"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esafirm.kotlin-formatter"
vscode "estvid.estv"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.code-runner"
vscode "fwcd.kotlin"
vscode "garmin.monkey-c"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "grapecity.gc-excelviewer"
vscode "icrawl.discord-vscode"
vscode "james-yu.latex-workshop"
vscode "johnharrison.bongocat-buddy"
vscode "k--kato.docomment"
vscode "kevinrose.vsc-python-indent"
vscode "kleber-swf.unity-code-snippets"
vscode "leodevbro.blockman"
vscode "manasxx.background-cover"
vscode "marus25.cortex-debug"
vscode "mathiasfrohlich.kotlin"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mikankari.msky4vscode"
vscode "mosapride.zenkaku"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "natizyskunk.sftp"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "oracle.oracle-java"
vscode "paulober.pico-w-go"
vscode "platformio.platformio-ide"
vscode "raspberry-pi.raspberry-pi-pico"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "sdras.night-owl"
vscode "sgryjp.japanese-word-handler"
vscode "streetsidesoftware.code-spell-checker"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "thatonecalculator.aiscript"
vscode "tht13.html-preview-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wesbos.theme-cobalt2"
vscode "wholroyd.jinja"
